torvalds/linux/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_mp.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/
#define _RTL8723A_MP_C_
#ifdef CONFIG_MP_INCLUDED

#include <drv_types.h>
#include <rtw_mp.h>
#include <rtl8723a_hal.h>


/*-----------------------------------------------------------------------------
 * Function:	mpt_SwitchRfSetting
 *
 * Overview:	Change RF Setting when we siwthc channel/rate/BW for MP.
 *
 * Input:		IN	PADAPTER				pAdapter
 *
 * Output:		NONE
 *
 * Return:		NONE
 *
 * Revised History:
 * When 		Who 	Remark
 * 01/08/2009	MHC 	Suggestion from SD3 Willis for 92S series.
 * 01/09/2009	MHC 	Add CCK modification for 40MHZ. Suggestion from SD3.
 *
 *---------------------------------------------------------------------------*/
 static void phy_SwitchRfSetting8723A(PADAPTER	 pAdapter,u8 channel )
{

	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(pAdapter);
    u32					u4RF_IPA[3], u4RF_TXBIAS, u4RF_SYN_G2;
    
	//default value
	{
		u4RF_IPA[0] = 0x4F424;			//CCK
		u4RF_IPA[1] = 0xCF424;			//OFDM
		u4RF_IPA[2] = 0x8F424;			//MCS	
		u4RF_TXBIAS = 0xC0356;							
		u4RF_SYN_G2 = 0x4F200;																
	}

	switch(channel)
	{
		case 1:
			u4RF_IPA[0] = 0x4F40C;			
			u4RF_IPA[1] = 0xCF466;	
			u4RF_TXBIAS = 0xC0350;						
			break;

		case 2:
			u4RF_IPA[0] =  0x4F407; 		
			u4RF_TXBIAS =  0xC0350; 								
			break;

		case 3:
			u4RF_IPA[0] =  0x4F407; 		
			u4RF_IPA[2] =  0x8F466; 			
			u4RF_TXBIAS =  0xC0350; 								
			break;

		case 5:
		case 8: 
			u4RF_SYN_G2 =  0x0F400; 											
			break;

		case 6:
		case 13:	
			u4RF_IPA[0] =  0x4F40C; 		
			break;

		case 7: 
			u4RF_IPA[0] =  0x4F40C; 		
			u4RF_SYN_G2 =  0x0F400; 														
			break;			

		case 9:
			u4RF_IPA[2] =  0x8F454; 		
			u4RF_SYN_G2 =  0x0F400; 														
			break;

		case 11:	
			u4RF_IPA[0] =  0x4F40C; 		
			u4RF_IPA[1] =  0xCF454; 
			u4RF_SYN_G2 =  0x0F400; 														
			break;

		default:
			u4RF_IPA[0] =  0x4F424; 		
			u4RF_IPA[1] =  0x8F424; 			
			u4RF_IPA[2] =  0xCF424; 				
			u4RF_TXBIAS =  0xC0356; 						
			u4RF_SYN_G2 =  0x4F200; 																
			break;
	}

	PHY_SetRFReg(pAdapter, RF_PATH_A, RF_IPA, bRFRegOffsetMask, u4RF_IPA[0]);
	PHY_SetRFReg(pAdapter, RF_PATH_A, RF_IPA, bRFRegOffsetMask, u4RF_IPA[1]);
	PHY_SetRFReg(pAdapter, RF_PATH_A, RF_IPA, bRFRegOffsetMask, u4RF_IPA[2]);
	PHY_SetRFReg(pAdapter, RF_PATH_A, RF_TXBIAS, bRFRegOffsetMask, u4RF_TXBIAS);	
	PHY_SetRFReg(pAdapter, RF_PATH_A, RF_SYN_G2, bRFRegOffsetMask, u4RF_SYN_G2);

}	




void Hal_mpt_SwitchRfSetting(PADAPTER pAdapter)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(pAdapter);
	PMPT_CONTEXT		pMptCtx = &(pAdapter->mppriv.MptCtx);
	u8				ChannelToSw = pMptCtx->MptChannelToSw;
	
	phy_SwitchRfSetting8723A(pAdapter, ChannelToSw);
}	




s32 Hal_SetPowerTracking(PADAPTER padapter, u8 enable)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	struct dm_priv	*pdmpriv = &pHalData->dmpriv;


	if (!netif_running(padapter->pnetdev)) {
		RT_TRACE(_module_mp_, _drv_warning_, ("SetPowerTracking! Fail: interface not opened!\n"));
		return _FAIL;
	}

	if (check_fwstate(&padapter->mlmepriv, WIFI_MP_STATE) == _FALSE) {
		RT_TRACE(_module_mp_, _drv_warning_, ("SetPowerTracking! Fail: not in MP mode!\n"));
		return _FAIL;
	}

	if (enable)
		pdmpriv->TxPowerTrackControl = _TRUE;
	else
		pdmpriv->TxPowerTrackControl = _FALSE;

	return _SUCCESS;
}

void Hal_GetPowerTracking(PADAPTER padapter, u8 *enable)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	struct dm_priv	*pdmpriv = &pHalData->dmpriv;


	*enable = pdmpriv->TxPowerTrackControl;
}

static void Hal_disable_dm(PADAPTER padapter)
{
	u8 v8;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	struct dm_priv	*pdmpriv = &pHalData->dmpriv;


	//3 1. disable firmware dynamic mechanism
	// disable Power Training, Rate Adaptive
	v8 = rtw_read8(padapter, REG_BCN_CTRL);
	v8 &= ~EN_BCN_FUNCTION;
	rtw_write8(padapter, REG_BCN_CTRL, v8);

	//3 2. disable driver dynamic mechanism
	// disable Dynamic Initial Gain
	// disable High Power
	// disable Power Tracking
	Switch_DM_Func(padapter, DYNAMIC_FUNC_DISABLE, _FALSE);

	// enable APK, LCK and IQK but disable power tracking
	pdmpriv->TxPowerTrackControl = _FALSE;
	Switch_DM_Func(padapter, DYNAMIC_RF_TX_PWR_TRACK , _TRUE);
}

void Hal_MPT_CCKTxPowerAdjust(PADAPTER Adapter, BOOLEAN bInCH14)
{
	u32		TempVal = 0, TempVal2 = 0, TempVal3 = 0;
	u32		CurrCCKSwingVal = 0, CCKSwingIndex = 12;
	u8		i;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);


	// get current cck swing value and check 0xa22 & 0xa23 later to match the table.
	CurrCCKSwingVal = read_bbreg(Adapter, rCCK0_TxFilter1, bMaskHWord);

	if (!bInCH14)
	{
		// Readback the current bb cck swing value and compare with the table to
		// get the current swing index
		for (i = 0; i < CCK_TABLE_SIZE; i++)
		{
			if (((CurrCCKSwingVal&0xff) == (u32)CCKSwingTable_Ch1_Ch13[i][0]) &&
				(((CurrCCKSwingVal&0xff00)>>8) == (u32)CCKSwingTable_Ch1_Ch13[i][1]))
			{
				CCKSwingIndex = i;
//				RT_TRACE(COMP_INIT, DBG_LOUD,("Ch1~13, Current reg0x%x = 0x%lx, CCKSwingIndex=0x%x\n",
//					(rCCK0_TxFilter1+2), CurrCCKSwingVal, CCKSwingIndex));
				break;
			}
		}

		//Write 0xa22 0xa23
		TempVal = CCKSwingTable_Ch1_Ch13[CCKSwingIndex][0] +
				(CCKSwingTable_Ch1_Ch13[CCKSwingIndex][1]<<8) ;


